In [8]:
# Import the necessary modules
import pyodbc
import os
import pandas as pd

In [11]:
# Define the connection and specify a query to run
# Change the values of server & PWD & warehouse to match your demo environment
cn_str = '''Driver={SnowflakeDSIIDriver};'''
cn_str = cn_str + f'''server={os.getenv('SNOW_ACCOUNT')}.snowflakecomputing.com;
database={os.getenv('SNOW_DATABASE')};
warehouse={os.getenv('SNOW_WAREHOUSE')};
schema=public;
UID={os.getenv('SNOW_USER')};
PWD={os.getenv('SNOW_PASSWORD')}'''
cn = pyodbc.connect(cn_str)
cn.setencoding('utf-8')

In [12]:
sql = "create or replace table sample_product_data (id int, parent_id int, category_id int, name varchar, serial_number varchar, key int, \"3rd\" int);"
cn.execute(sql)
sql = """insert into sample_product_data values
    (1, 0, 5, 'Product 1', 'prod-1', 1, 10),
    (2, 1, 5, 'Product 1A', 'prod-1-A', 1, 20),
    (3, 1, 5, 'Product 1B', 'prod-1-B', 1, 30),
    (4, 0, 10, 'Product 2', 'prod-2', 2, 40),
    (5, 4, 10, 'Product 2A', 'prod-2-A', 2, 50),
    (6, 4, 10, 'Product 2B', 'prod-2-B', 2, 60),
    (7, 0, 20, 'Product 3', 'prod-3', 3, 70),
    (8, 7, 20, 'Product 3A', 'prod-3-A', 3, 80),
    (9, 7, 20, 'Product 3B', 'prod-3-B', 3, 90),
    (10, 0, 50, 'Product 4', 'prod-4', 4, 100),
    (11, 10, 50, 'Product 4A', 'prod-4-A', 4, 100),
    (12, 10, 50, 'Product 4B', 'prod-4-B', 4, 100);"""
cn.execute(sql)

In [22]:
sql = """CREATE OR REPLACE TABLE Countries (
    Id INT NOT NULL,
    ISO VARCHAR(2) NOT NULL,
    ISO3 VARCHAR(3) NOT NULL,
    ISONumeric INT NOT NULL,
    CountryName VARCHAR(64) NOT NULL,
    Capital VARCHAR(64) NOT NULL,
    ContinentCode VARCHAR(2) NOT NULL,
    CurrencyCode VARCHAR(3) NOT NULL)"""
res = cn.execute(sql)

In [24]:
sql = """
INSERT INTO Countries
    (Id,ISO, ISO3, ISONumeric, CountryName, Capital, ContinentCode, CurrencyCode)
VALUES
    (1,'AU', 'AUS', 36, 'Australia', 'Canberra', 'OC', 'AUD'),
    (2,'DE', 'DEU', 276, 'Germany', 'Berlin', 'EU', 'EUR'),
    (3,'IN', 'IND', 356, 'India', 'New Delhi', 'AS', 'INR'),
    (4,'LA', 'LAO', 418, 'Laos', 'Vientiane', 'AS', 'LAK'),
    (5,'US', 'USA', 840, 'United States', 'Washington', 'NA', 'USD'),
    (6,'ZW', 'ZWE', 716, 'Zimbabwe', 'Harare', 'AF', 'ZWL')
    """
res = cn.execute(sql)

In [13]:
# Run the SQL and store the results in the res object
#%%time
sql = "select * from sample_product_data"
res = cn.execute(sql).fetchall()

In [14]:
# Run the SQL And store the results in the df object
#%%time
df = pd.read_sql(sql, cn)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   I              12 non-null     float64
 1   P A R E N      12 non-null     float64
 2   C A T E G O    12 non-null     float64
 3   N A            12 non-null     object
 4   S E R I A L _  12 non-null     object
 5   K E            12 non-null     float64
 6   3 r            12 non-null     float64
dtypes: float64(5), object(2)
memory usage: 800.0+ bytes

In [16]:
pd.isnull(df).any()

I                False
P A R E N        False
C A T E G O      False
N A              False
S E R I A L _    False
K E              False
3 r              False
dtype: bool

In [18]:
df.describe()

              I   P A R E N  C A T E G O        K E        3 r
count  12.000000  12.000000    12.000000  12.000000   12.00000
mean    6.500000   3.666667    21.250000   2.500000   62.50000
std     3.605551   3.938928    18.231466   1.167748   32.50874
min     1.000000   0.000000     5.000000   1.000000   10.00000
25%     3.750000   0.000000     8.750000   1.750000   37.50000
50%     6.500000   2.500000    15.000000   2.500000   65.00000
75%     9.250000   7.000000    27.500000   3.250000   92.50000
max    12.000000  10.000000    50.000000   4.000000  100.00000